<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN" "http://www.w3.org/TR/html4/loose.dtd">
<html lang="en">
<head>
    <title>Engine Driver Ovlada&#269; pro Android</title>
    <style type="text/css">
        p {margin-top:0;padding-left:1em;}
        h3 {margin-bottom:0;}
        dl {padding-left: 2em;}
        ul {margin-left:1em;margin-top:-1em;padding-left:0;}
        ul li {position:relative;left:1em;padding-right:1em;}
    </style>
</head>
<body>
<h1>Engine Driver Ovlada&#269; pro Android</h1>
<em><a href='http://enginedriver.mstevetodd.com' >[webov&aacute; str&aacute;nka]</a></em>
<img src="file:///android_asset/engine_driver_icon.png" height="144" width="166" style="float:left;padding:0 8px 8px 0"/>
<p><b>Posledn&iacute; zm&#283;ny pro tuto verzi obsahuj&iacute;:</b></p>
<ul>
    <li>Možnost zobrazovat tlačítko pro posunování / rychlost Switching (pouze vertikální Throttle)</li>
    <li>Opravit problém v ‚kapky před získat až‘ při opětovném sellecting stejnou lokomotivu</li>
</ul>
<p><em><a
        href="https://raw.githubusercontent.com/JMRI/EngineDriver/master/changelog-and-todo-list.txt"
        target="_blank" title="View complete EngineDriver changelog">[zobrazit &uacute;pln&yacute; seznam zm&#283;n]</a></em></p>
<p>Tato zdarma poskytovan&aacute; aplikace se m&#367;&#382;e p&#345;ipojit na <a
        href="http://jmri.sourceforge.net/help/en/package/jmri/jmrit/withrottle/UserInterface.shtml"
        target="_blank">JMRI WiThrottle</a> server b&#283;&#382;&iacute;c&iacute; na po&#269;&iacute;ta&#269;i,
    na <a href="http://www.modelrectifier.com/category-s/332.htm" target="_blank">MRC Prodigy WiFi</a>,
    nebo na a <a href="http://www.digitrax.com/products/wireless/lnwi/" target="_blank">Digitrax LnWi</a>,
    a &#345;&iacute;dit va&scaron;e lokomotivy a cel&eacute; koleji&scaron;t&#283;.
    Rychlost, sm&#283;r a a&#382; 29 DCC funkc&iacute; je podporov&aacute;no pro jednu a&#382; &scaron;est lokomotiv nebo souprav.
    M&#367;&#382;ete ovl&aacute;dat nap&aacute;jen&iacute; koleji&scaron;t&#283;, v&yacute;hybky a cesty, zobrazovat panely a dal&scaron;&iacute; JMRI okna s pou&#382;it&iacute;m
    zobrazen&iacute; webu.
    M&#367;&#382;ete tak&eacute; vytv&aacute;&#345;et a upravovat soupravy (softwarov&#283; definovan&eacute;).
    M&#367;&#382;ete tak&#233; ovl&#225;dat nap&#225;jen&#237; koleji&#353;t&#283;, v&#253;hybky, cesty a p&#345;istupovat k webov&#253;m panel&#367;m a okn&#367;m JMRI.
</p>
<p>Pro dal&scaron;&iacute; podrobnosti nav&scaron;tivte <a href="https://enginedriver.mstevetodd.com" target="_blank">[str&aacute;nku&nbsp;EngineDriver]</a>.
    Pro screenshots, klikn&#283;te <a href="https://enginedriver.mstevetodd.com/screenshots"
                                      target="_blank">[zde]</a>.</p>
<h3>P&#345;edpoklady (pro JMRI):</h3>
<p>Ov&#283;&#345;te, &#382;e va&scaron;e Android za&#345;&iacute;zen&iacute; se m&#367;&#382;e p&#345;ipojit na va&scaron;i s&iacute;&#357; prost&#345;ednictv&iacute;m WiFi a z&iacute;skat IP adresu.<br/>
    Ujist&#283;te se, &#382;e pou&#382;&iacute;v&aacute;te posledn&iacute; verzi <a href="http://jmri.org/" target="_blank">JMRI</a>
    (2.8 funguje, 3.0+ je mnohem lep&scaron;&iacute;) na va&scaron;em po&#269;&iacute;ta&#269;i, a ten je p&#345;ipojen ke koleji&scaron;ti.
    Spus&#357;te JMRI a ov&#283;&#345;te &#382;e m&#367;&#382;ete pou&#382;&iacute;t dod&aacute;vanou aplikaci "Ovlada&#269;" pro &#345;&iacute;zen&iacute; lokomotiv na
    va&scaron;em koleji&scaron;ti.</p>
<p>Spus&#357;te <a
        href="http://jmri.sourceforge.net/help/en/package/jmri/jmrit/withrottle/UserInterface.shtml"
        target="_blank">WiThrottle</a> funkci JMRI, um&iacute;st&#283;nou v DecoderPro v menu N&aacute;stroje,
    Ovlada&#269;e. D&aacute;le se doporu&#269;uje abyste spustili <a
            href="http://jmri.sourceforge.net/help/en/html/web/index.shtml" target="_blank"
            title="Learn more about JMRI Web Server">JMRI Web Server</a>
    funkci (N&aacute;stroje, Start JMRI Web Server).
    Ob&#283; tyto polo&#382;ky by m&#283;ly b&yacute;t p&#345;id&aacute;ny tak&eacute; do P&#345;edvolby, Startov&aacute;n&iacute;.</p>
<h3>P&#345;edpoklady (pro MRC Wifi):</h3>
<p>P&#345;ipojte modul MRC WiFi a ov&#283;&#345;te &#382;e se va&scaron;e za&#345;&iacute;zen&iacute; m&#367;&#382;e p&#345;ipojit na tuto s&iacute;&#357; a z&iacute;skat IP adresu.</p>
<h3>P&#345;edpoklady (pro Digitrax LnWi):</h3>
<p>P&#345;ipojte LnWi a ov&#283;&#345;te &#382;e se va&scaron;e za&#345;&iacute;zen&iacute; m&#367;&#382;e p&#345;ipojit na tuto s&iacute;&#357; a z&iacute;skat IP adresu.</p>
<h3>Provoz:</h3>
<p>Ve va&scaron;em telefonu spus&#357;te aplikaci Engine Driver a po&#269;kejte a&#382; se zobraz&iacute; adresa va&scaron;eho serveru v
    "Nalezen&eacute; servery".</p>
<p>Klikn&#283;te na nalezenou adresu nebo m&#367;&#382;ete zadat adresu a port va&#269;eho WiThrottle serveu p&#345;&iacute;mo.
    (Pou&#382;ijte hodnoty zobrazen&eacute; v okn&#283; WiThrottle.)<br/>
    Pokud chcete tak m&#367;&#382;ete v p&#345;edvolb&aacute;ch povolit nastaven&iacute; "Automatick&eacute; p&#345;ipojen&iacute; se k prvn&iacute;mu WiThrottle serveru?".
    K dispozici je tak&eacute; "demo" server na adrese jmri.mstevetodd.com, port 44444, ke kter&eacute;mu se
    m&#367;&#382;ete p&#345;ipojit pro testov&aacute;n&iacute;.</p>
<p>Na obrazovce ovlada&#269;e klikn&#283;te na tla&#269;&iacute;tko lokomotivy "Vybrat" pro ka&#382;dou lokomotivu.<br/>
    Na dal&scaron;&iacute; obrazovce zvolte zp&#367;sob v&yacute;b&#283;ru
    On the next
    screen, choose method of selection (DCC adresa, JMRI evidence nebo Ned&aacute;vn&eacute;).
    Po v&yacute;b&#283;ru lokomotivy se vr&aacute;t&iacute;te na obrazovku ovlada&#269;e.<br/>
    Pro z&iacute;sk&aacute;n&iacute; dal&scaron;&iacute;ch vlak&#367; toto opakujte s pou&#382;it&iacute;m dal&scaron;&iacute;ch tla&#269;&iacute;tek "Vybrat".<br/>
    Pozn&aacute;mka: stisknut&iacute;m a podr&#382;en&iacute;m polo&#382;ky evidence se zobraz&iacute; dal&scaron;&iacute; podrobnosti z evidence.</p>
<p>Ovl&aacute;dejte pomoc&iacute; posuvn&iacute;ku (nebo ovlada&#269;e hlasitosti) (nebo voliteln&#283; tla&#269;&iacute;tky se &scaron;ipkami)
    rychlost va&scaron;&iacute; lokomotivy. Pomoc&iacute; tla&#269;&iacute;tek Zp&#283;t, Zastavit a Vp&#345;ed ovl&aacute;dejte sm&#283;r.<br/>
    Pro propu&scaron;t&#283;n&iacute; v&scaron;ech lokomotiv sta&#269;&iacute; stisknout tla&#269;&iacute;tko telefonu Zp&#283;t a ukon&#269;it aplikaci.
    Toto tak&eacute; zastav&iacute; va&scaron;e lokomotivy (m&#367;&#382;e b&yacute;t p&#345;enastaveno v p&#345;edvolb&aacute;ch).
    Mu&#382;ete tak&eacute; op&#283;tovn&#283; p&#345;i&#345;adit ovl&aacute;d&aacute;n&iacute; hlasitosti klikem na indik&aacute;tor rychlosti (mal&eacute; "v" se zobraz&iacute;
    u toho kdo je &#345;&iacute;zen).</p>
<p>Chcete-li vytvo&#345;it soupravu (p&#345;&iacute;p&#345;e&#382;/postrk) "za b&#283;hu",
    jednodu&scaron;e vyberte dal&scaron;&iacute; lokomotivu pro ten sam&yacute; ovlada&#269;. Budete po&#382;&aacute;dn&aacute;ni o ur&#269;en&iacute; sm&#283;ru
    ka&#382;d&eacute; lokomotivy oshledem za za&#345;azen&iacute; v dan&eacute; souprav&#283;.
    Sm&#283;r a rychlost bude odes&iacute;l&aacute;na v&scaron;em lokomotiv&aacute;m v souprav&#283;.
    Propustit provede propu&scaron;t&#283;n&iacute; v&scaron;ech lokomotiv dan&eacute;ho ovlada&#269;e.</p>
<p>Stiskem tla&#269;&iacute;tka telefonu Nab&iacute;dka se dostanete do obrazovek pro V&yacute;hybky, Cesty a &#344;&iacute;zen&iacute; nap&aacute;jen&iacute;, a tak&eacute;
    k nastaven&iacute; &#345;ady p&#345;edvoleb.</p>
<p>Tak&eacute; m&#367;&#382;ete rychle "p&#345;ehazovat" vlevo nebo vpravo pro rychl&eacute; p&#345;esko&#269;en&iacute; vzad a vp&#345;ed mezi str&aacute;nkou Ovlada&#269;e,
    Cesty a V&yacute;hybky.</p>
<h3>Provoz ESU MobileControl II:</h3>
<p>Aplikace Engine Driver pln&#283; podporuje ovlada&#269; Android
    <a href="http://www.esu.eu/en/products/digital-control/mobile-control-ii/">ESU MobileControl II</a>.</p>
<p>Tak jako je mo&#382;n&eacute; &#345;&iacute;dit rychlost vybran&yacute;m ovlada&#269;em oto&#269;n&yacute;m kole&#269;kem,
    stejn&#283; tak je mo&#382;n&eacute; p&#345;ep&iacute;nat sm&#283;r pomoc&iacute; nulov&eacute; polohy na koncov&eacute; pozici.</p>
<p>A&#382; t&#345;i vlaky mohou b&yacute;t &#345;&iacute;zeny sou&#269;asn&#283; &ndash; vlak kter&yacute; je &#345;&iacute;zen ovl&aacute;dac&iacute;m kole&#269;kem je zv&yacute;razn&#283;n
    mal&yacute;m "v" na ukazateli rychlosti. P&#345;ep&iacute;n&aacute;n&iacute; mezi ovl&aacute;dan&yacute;mi vlaky se prov&aacute;d&iacute; klikem na p&#345;&iacute;slu&scaron;n&yacute;
    ukazatel rychlosti. Je tak&eacute; mo&#382;n&eacute; p&#345;i&#345;adit jedno postrann&iacute; tla&#269;&iacute;tko za&#345;&iacute;zen&iacute; pro p&#345;ep&iacute;n&aacute;n&iacute;
    mezi ovl&aacute;dan&yacute;mi vlaky &ndash; ve v&yacute;choz&iacute;m nastaven&iacute; m&aacute; tuto funkci prav&eacute; doln&iacute; tla&#269;&iacute;tko.</p>
<p>Pokud je p&#345;i&#345;azen k &#345;&iacute;zen&iacute; vlak, potom zelen&aacute; LED sv&iacute;t&iacute;. Pokud nen&iacute; p&#345;i&#345;azen &#382;&aacute;dn&yacute; vlak,
    tak zelen&aacute; LED blik&aacute;.</p>
<p>Mimo to m&#367;&#382;ete tak&eacute; pomoc&iacute; tla&#269;&iacute;tka Stop zastavit pr&aacute;v&#283; &#345;&iacute;zen&yacute; vlak nebo zastavit v&scaron;echny &#345;&iacute;zen&eacute; vlaky.
    Kr&aacute;tk&yacute; stist tla&#269;&iacute;tka Stop (v&yacute;choz&iacute; nastaven&iacute; je m&eacute;n&#283; ne&#382; 1/2 vte&#345;iny) zastav&iacute; j&iacute;zdu
    pr&aacute;v&#283; &#345;&iacute;zen&eacute;ho vlaku. Na znamen&iacute; t&eacute;to akce se &#269;erven&aacute; LED rychle rozblik&aacute;.
    P&#345;i stisku tla&#269;&iacute;tka Stop na jednu vte&#345;inu se pr&aacute;v&#283; &#345;&iacute;zen&yacute; vlak vr&aacute;t&iacute; na p&#367;vodn&#283;
    nastavenou rychlost. Dlouh&yacute; stisk tla&#269;&iacute;tka Stop (v&yacute;choz&iacute; nastaven&iacute; je d&eacute;le ne&#382; 1/2 vte&#345;iny)
    zastav&iacute; j&iacute;zdu v&scaron;ech &#345;&iacute;zen&yacute;ch vlak&#367;. Na znamen&iacute; t&eacute;to akce se &#269;erven&aacute; LED rozblik&aacute; pomalu.
    P&#345;i stisku tla&#269;&iacute;tka Stop na jednu vte&#345;inu z&#367;stanou v&scaron;echny &#345;&iacute;zen&eacute; vlaky st&aacute;t a
    je mo&#382;n&eacute; znovu ovl&aacute;dat v&scaron;echny pr&aacute;v&#283; vybran&eacute; vlaky.</p>
<p>V re&#382;imu Stop jsou tla&#269;&iacute;tka zm&#283;ny rychlosti a posuvn&iacute;ky zak&aacute;z&aacute;ny pro aktu&aacute;ln&#283; zastaven&eacute;
    ovlada&#269;e. P&#345;ep&iacute;n&aacute;n&iacute; mezi &#345;&iacute;zen&yacute;mi ovlada&#269;i je tak&eacute; zak&aacute;zan&eacute;.</p>
<p>Je tak&eacute; mo&#382;n&eacute; nastavit postrann&iacute; tla&#269;&iacute;tka za&#345;&iacute;zen&iacute; na prov&aacute;d&#283;n&iacute; r&#367;zn&yacute;ch akc&iacute;.
    V&yacute;choz&iacute; nastaven&iacute; je n&aacute;sleduj&iacute;c&iacute;:</p>
<dl>
    <dt>Horn&iacute; lev&eacute;</dt><dd>Zv&yacute;&scaron;en&iacute; rychlosti</dd>
    <dt>Doln&iacute; lev&eacute;</dt><dd>Sn&iacute;&#382;en&iacute; rychlosti</dd>
    <dt>Horn&iacute; prav&eacute;</dt><dd>Zm&#283;na sm&#283;ru</dd>
    <dt>Doln&iacute; prav&eacute;</dt><dd>Vybrat dal&scaron;&iacute; ovlada&#269;</dd>
</dl>
<p>Toto p&#345;i&#345;azen&iacute; lze zm&#283;nit v P&#345;edvolby na str&aacute;nce volby ESU MobileControl II.</p>
<h3>Konfigurace:</h3>
<p>V P&#345;edvolb&aacute;ch jsou rozs&aacute;hl&eacute; mo&#382;nosti nastaven&iacute; obrazovek a akc&iacute; Engine Driver tak,
    aby nejl&eacute;pe vyhovovali va&scaron;emu za&#345;&iacute;zen&iacute;, rozlo&#382;en&iacute; a va&scaron;em osobn&iacute;mu stylu.
    Mezi n&#283; pat&#345;&iacute; uspo&#345;&aacute;d&aacute;n&iacute; ovlada&#269;e, zobrazen&iacute; modelov&yacute;ch hodin, volby rychlostn&iacute;ch krok&#367;,
    zobrazen&iacute; webu, rozm&#283;ry tla&#269;&iacute;tek, dodate&#269;n&aacute; tla&#269;&iacute;tka, rozm&#283;ry posuvn&iacute;ku a jeho chov&aacute;n&iacute;,
    po&#269;et zobrazen&yacute;ch ovlada&#269;&#367;, zastaven&iacute; p&#345;i propu&scaron;t&#283;n&iacute;, povolen&iacute;/z&aacute;kaz sestaven&iacute; souprava za b&#283;hu,
    automatick&eacute; p&#345;ipojen&iacute;, a mnoho dal&scaron;&iacute;ho.</p>
<p>Pokud jste v evidenci na serveru zadali &scaron;t&iacute;tky funkc&iacute;, tak budou pou&#382;ity.
    Pokud ne, tak m&#367;&#382;ete pou&#382;&iacute;t volbu nab&iacute;dky V&yacute;choz&iacute; nastaven&iacute; funkc&iacute; pro nastaven&iacute; na v&yacute;choz&iacute; hodnoty
    &scaron;t&iacute;tk&#367; funkc&iacute; a &#269;&iacute;sla funkc&iacute; pro zobrazen&iacute;. Tla&#269;&iacute;tka lze odstranit pomoc&iacute; vymaz&aacute;n&iacute; jeho &scaron;t&iacute;tku.</p>
<p>Na stran&#283; po&#269;&iacute;ta&#269;e JMRI zkontrolujte va&scaron;e p&#345;edvolby WiThrottle a ujist&#283;te se &#382;e dovoluj&iacute; nebo zakazuj&iacute;
    pou&#382;it&iacute; po&#382;adovan&yacute;ch vlastnost&iacute;.
    Pokud jste v panelu definovali v&yacute;hybky a cesty tak se ujist&#283;te, &#382;e jste zadali "u&#382;ivatelsk&yacute; n&aacute;zev"
    pro tato za&#345;&iacute;zen&iacute; takov&yacute;, kter&yacute; chcete vid&#283;t v seznamu ve va&scaron;em ovlada&#269;i.
    M&#367;&#382;ete tak&eacute; "filtrovat" zobrazen&iacute; v&yacute;hybek pou&#382;it&iacute;m WiThrottle-&amp;gt;Filtr volba &#345;&iacute;zen&iacute;
    v okn&#283; WiThrottle. Tak&eacute; se doporu&#269;uje povolit "Pou&#382;&iacute;t EStop".</p>
<p>Zad&aacute;n&iacute; z&aacute;znam&#367; evidence a definice cest a v&yacute;hybek v JMRI zv&yacute;&scaron;&iacute; schopnosti va&scaron;eho
    ovlada&#269;e Engine Driver a u&#269;in&iacute; ho sn&aacute;ze pou&#382;iteln&yacute;m (i kdy&#382; to nen&iacute; bezpodm&iacute;ne&#269;n&#283; nutn&eacute;).
    Pokud je spu&scaron;t&#283;n JMRI Web Server bude Engine Driver zobrazovat v&iacute;ce informac&iacute; (jako nap&#345;.
    podrobnosti evidence a obr&aacute;zky ikon).</p>
<h3>V&yacute;voj:</h3>
<p>Engine Driver je svobodn&yacute; a open source software, sou&#269;&aacute;st projektu
    <a href="http://jmri.org" target="_blank">JMRI</a>. Je naprogramov&aacute;n v
    <a href="https://developer.android.com/studio/" target="_blank">Android Studio</a>.
    M&#367;&#382;ete proch&aacute;zet nebo klonovat aktu&aacute;ln&iacute; v&yacute;vojov&yacute; zdrojov&yacute; k&oacute;d (se zna&#269;kami pro d&#345;&iacute;v&#283;j&scaron;&iacute; verze)
    <a href="https://github.com/JMRI/EngineDriver" target="_blank">[ZDE].</a> V&aacute;&#382;&iacute;me si p&#345;&iacute;sp&#283;vk&#367; v&yacute;voj&aacute;&#345;&#367;.</p>
<hr>
<p><a href="https://enginedriver.mstevetodd.com" target="_blank">[Domovsk&aacute; str&aacute;nka pro EngineDriver]</a></p>
</body>
</html>
